festival-app/app/controllers/festivals_controller.rb

SELECT "festivals".* FROM "festivals"
---
    def index
        render json: Festival.all

INSERT INTO "festivals" ("festival_name", "location", "duration", "description", "link") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        festival = Festival.create(
            festival_name: params[:festival_name],
            location: params[:location],
            duration: params[:duration],
            description: params[:description],
            link: params[:link]
        )

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        festival = Festival.find(params[:id])

DELETE FROM "festivals" WHERE "festivals"."id" = $1  [["id", 3]]
---
    def destroy
        Festival.destroy(params[:id])