festival-app/app/controllers/api/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "NicoleC"], ["LIMIT", 1]]
---
    def login
        user = User.find_by(name: params[:name])