festival-app/app/controllers/api/festivals_controller.rb

SELECT "festivals".* FROM "festivals"
---
    def index
        render json: Festival.all

INSERT INTO "festivals" ("festival_name", "location", "duration", "description", "link") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["festival_name", "testin"], ["location", "k"], ["duration", 0], ["description", "k"], ["link", "k"]]
---
    def create
        festival = Festival.create(
            festival_name: params[:festival_name],
            location: params[:location],
            duration: params[:duration],
            description: params[:description],
            link: params[:link]
        )

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        p params[:id]
        render json: Festival.find(params[:id])

SELECT "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "festivals" SET "festival_name" = $1 WHERE "festivals"."id" = $2  [["festival_name", "Nicole"], ["id", 4]]
---
    def update
        festival = Festival.find(params[:id])
        festival.update(
            festival_name: params[:festival_name],
            location: params[:location],
            duration: params[:duration],
            description: params[:description],
            link: params[:link]
        )

DELETE FROM "festivals" WHERE "festivals"."id" = $1  [["id", 4]]
---
    def destroy
        Festival.destroy(params[:id])