festival-app/app/controllers/api/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "password_digest") VALUES ($1, $2) RETURNING "id"  [["name", "GeorgiaB"], ["password_digest", "$2a$12$1bCtqZ36JxHmL5VBNy9FfOKfct9wxY6Kwv1PBBHCEUc/JODmD.bAC"]]

    def show
        p params[:id]
        render json: User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        user = User.find(params[:id])
        user.update(user_params)
        render json: User.find(params[:id]).update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1 WHERE "users"."id" = $2  [["password_digest", "$2a$12$OghiAwBBZ5jgTkKp23URLO4e523z41nLUCv6Ef6Wa9vHRfgvriKG6"], ["id", 1]]

    def destroy
        User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]